# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц (зима,
# весна, лето, осень). Напишите решения через list и через dict.
a = int(input('Введите число месяц: '))
month = {1: "январь", 2: "февраль", 3: "март", 4: "апрель", 5: "май", 6: "июнь", 7: "июль", 8: "август",
         9: "сентябрь", 10: "октрябрь", 11: "ноябрь", 12: "декабрь"}
print(month.get(a))

b = int(input('Введите число месяц: '))
month1 = ["январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август",
          "сентябрь", "октрябрь", "ноябрь", "декабрь"]

print(month1[b-1])
